tests/load/batch-deletion.yml
# Artillery load test for batch deletion performance
# Validates React 18 automatic batching handles 1,000+ messages without UI blocking
# Target: <100ms render time for batch deletion

config:
  target: "http://localhost:8080"
  phases:
    - duration: 30
      arrivalRate: 1
      name: "Batch deletion load test"
  processor: "./batch-deletion-processor.js"
  variables:
    overlayId: "test-overlay-uuid"  # Replace with actual test overlay ID
    token: "test-jwt-token"          # Replace with valid JWT token

scenarios:
  - name: "1000 message batch deletion"
    flow:
      # Step 1: Send 1000 messages to overlay
      - function: "sendBatchMessages"

      # Step 2: Wait for messages to be processed and delivered
      - think: 5

      # Step 3: Trigger batch deletion (user timeout/ban)
      - function: "triggerBatchDeletion"

      # Step 4: Wait for deletion event propagation
      - think: 2

      # Step 5: Validate metrics
      - function: "validateMetrics"